results/finalTests/10_connections/NOQ2.out
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

DB SCHEMA public
0
DB SCHEMA public
3
DB SCHEMA public
5
DB SCHEMA public
1
DB SCHEMA public
7DB SCHEMA public
9

DB SCHEMA public
4
DB SCHEMA public
2
DB SCHEMA public
6
DB SCHEMA public
8
Threads started!

SQL statistics:
    queries performed:
        read:                            187820
        write:                           192755
        other:                           28744
        total:                           409319
    transactions:                        14362  (1434.03 per sec.)
    queries:                             409319 (40870.00 per sec.)
    ignored errors:                      78     (7.79 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0139s
    total number of events:              14362

Latency (ms):
         min:                                    1.52
         avg:                                    6.96
         max:                                   48.10
         95th percentile:                       13.95
         sum:                               100026.43

Threads fairness:
    events (avg/stddev):           1436.2000/160.61
    execution time (avg/stddev):   10.0026/0.00